tutorials/multiphase/vof/vofSolver/laminar/waves/waveFlume/constant/probeDefinitions
/*---------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      loggingProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

surfaceElevation
{
    type waveGauge;

    pointDistribution lineDistribution;
    N 179;
    linestart (0.10 -0.3 0.05);
    lineend   (17.9 -0.3 0.05);
    add       ( 0 0.45 0);
    axis      y;
    stretch 1.;

    writeControl adjustableRunTime;
    writeInterval 0.025;
}


// ************************************************************************* //
